vlm/base/DataProcessors/бит_АРМНормирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_АРМНормирования</Name>
			<Comment>ЛТ5.31</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/base/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТехнологическиеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МаршрутныеКарты</xr:Item>
				<xr:Item>Catalog.ТехнологическиеПроцессы</xr:Item>
				<xr:Item>Catalog.ЭтапыПроизводства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитВложенныйМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйМаршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор операции в маршрутной карте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Comment>Служебный реквизит для оптимизации запросов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормаВыработки</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КоличествоХодов</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормаВремени</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТехнологическаяСкорость</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_РасчетнаяМассаПровода</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КоэффициентИспользованияОборудования</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВыработкаПроводаСоВсейМашины</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КодОперации</Name>
					<Comment>ЛТ33</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КодыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_АгрегирующийКоэффициент</Name>
					<Comment>ЛТ33</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_РучнойВводНормыВыработки</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормативыВидаОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/ВидыРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРаботСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьТрудоемкости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификационныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/DataProcessors/бит_АРМНормирования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтатьяКалькуляцииПоУмолчанию = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СтатьяКалькуляцииОплатаТруда, ЭтотОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПриАктивизацииПосле", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьРазницаВыделенныеСтроки()
	
	Если СписокВыделенныхСтрок.Количество() <> Элементы.Список.ВыделенныеСтроки.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из СписокВыделенныхСтрок Цикл
		Если Элементы.Список.ВыделенныеСтроки.Найти(ТекЭлемент.Значение) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПриАктивизацииПосле() Экспорт

	Если (ЕстьИзмененияПараметров или ЕстьИзменениеВидовРабот) И ЕстьРазницаВыделенныеСтроки() Тогда
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеЗакрытия, "Изменения будут потеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПерезаполнитьПараметры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ, ДопПараметр) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьПараметры();
	Иначе
		Элементы.Список.ВыделенныеСтроки.Очистить();
		Для каждого стр из СписокВыделенныхСтрок Цикл
			Элементы.Список.ВыделенныеСтроки.Добавить(стр.Значение);
		КонецЦикла;                                 
		Элементы.Список.ТекущийЭлемент = СписокВыделенныхСтрок[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПараметры()                      
	
	ЕстьИзмененияПараметров = Ложь;
	ЕстьИзменениеВидовРабот = Ложь;
	
	мВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки;
	СписокВыделенныхСтрок.ЗагрузитьЗначения(мВыделенныхСтрок);
	
	Если СписокВыделенныхСтрок.Количество() = 1 Тогда 
		ТекОперация = СписокВыделенныхСтрок[0].Значение;  
		ТаблицаНакладных.Очистить(); 
		ЗаполнитьПоОднойОперации(ТекОперация);  
		
	иначе             
		ТекОперация = ПредопределенноеЗначение("Справочник.ТехнологическиеОперации.ПустаяСсылка"); 
		ВидыРабот.Очистить();
		РасценкиОперации.Очистить();
		ЗаполнитьПоНесколькимОперациям();
	КонецЕсли;  
	
	ДоступностьЭлементов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыРабот()
	
	ТаблицаВидовРабот = ТекОперация.Спецификация.Трудозатраты.Выгрузить(, "НомерСтроки,ВидРабот,Количество,СтатьяКалькуляции,НазначениеРабот,Этап,Операция");
	ТаблицаВидовРабот.Колонки.Добавить("ЗначениеВидимость", Новый ОписаниеТипов("Булево"));
	Для каждого стр Из ТаблицаВидовРабот Цикл
		стр.ЗначениеВидимость = (стр.Операция = ТекОперация);
	КонецЦикла;
	ВидыРабот.Загрузить(ТаблицаВидовРабот);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасценки()
	
	// Логика работы следующая: 
	// в регистре "Расценки на работы сотрудников" по измерениям "Период" и "Вид работ" 
	// отбираются уникальные значения ресурса "Расценка". 
	// Для каждой уникальной расценки происходит расчет стоимости операции как 
	// "Время выполнения" из левой нижней части * "Расценку". 
	// При этом единицы измерения "Времени выполнения" операции и "Вида работ" должны быть приведены к одной единице. 
	// По итогу в области "Расценка операции" при выделении операции в верхней части или изменении параметров операции 
	// в левой нижней части происходит перерасчет расценки операции для всех исторически сохранившихся расценок 
	// на виды работ.
	
	// Если указано несколько видов работ для одной операции, 
	// тогда значения стоимостей видов работ по операции суммируются.
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	РасценкиРаботСотрудников.Период КАК Период,
	                      |	РасценкиРаботСотрудников.ВидРабот КАК ВидРабот,
	                      |	РасценкиРаботСотрудников.Расценка КАК РасценкаОперации,
	                      |	РасценкиРаботСотрудников.ВидРабот.ЕдиницаИзмерения КАК ВидРаботЕдиницаИзмерения,
	                      |	&Валюта КАК Валюта
	                      |ИЗ
	                      |	РегистрСведений.РасценкиРаботСотрудников КАК РасценкиРаботСотрудников
	                      |ГДЕ
	                      |	РасценкиРаботСотрудников.ВидРабот В(&ВидРабот)");
	
	Запрос.УстановитьПараметр("ВидРабот", ТекОперация.Спецификация.Трудозатраты.ВыгрузитьКолонку("ВидРабот"));
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	Результат = Запрос.Выполнить().Выгрузить();                                                
	Результат.Колонки.Удалить("ВидРабот");    
	
	Для Каждого стр Из Результат Цикл 
		стр.РасценкаОперации = ВремяШтучное * ПересчитатьВремя(стр.РасценкаОперации, стр.ВидРаботЕдиницаИзмерения, ВремяШтучноеЕдИзм);
						//ПересчитатьВремя(ВремяШтучное, стр.ВидРаботЕдиницаИзмерения, ВремяШтучноеЕдИзм)
	КонецЦикла;                
	Результат.Свернуть("Период, Валюта", "РасценкаОперации");
	РасценкиОперации.Загрузить(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьВремя(Знач ЗначениеВремени, Знач ИсходнаяЕдиница, Знач ЦелеваяЕдиница) Экспорт
	
	ВремяВСекундахИсходная = ИсходнаяЕдиница.Числитель;
	
    // Базовые коэффициенты в секундах
    Коэффициенты = Новый Соответствие;

    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Секунда, 1);
    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Минута,  60);
    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Час,     3600);
    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Сутки,   86400);             
	Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.День,    86400);
    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Месяц,   86400 * 30.4375);   // Условно
    Коэффициенты.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Год,     86400 * 30.4375 * 12);  // Условно

    // Приводим к секундам
    ЗначениеВСекундах = ЗначениеВремени / (ВремяВСекундахИсходная/ Коэффициенты[ЦелеваяЕдиница]);

    // Переводим в искомую единицу
    Возврат ЗначениеВСекундах;

КонецФункции

&НаСервере
Процедура ЗаполнитьПоНесколькимОперациям()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТехнологическиеОперации.Ссылка КАК Ссылка,
	                      |	ТехнологическиеОперации.бит_НормаВыработки КАК бит_НормаВыработки,
	                      |	ТехнологическиеОперации.бит_КоличествоХодов КАК бит_КоличествоХодов,
	                      |	ТехнологическиеОперации.бит_НормаВремени КАК бит_НормаВремени,
	                      |	ТехнологическиеОперации.бит_ТехнологическаяСкорость КАК бит_ТехнологическаяСкорость,
	                      |	ТехнологическиеОперации.бит_РасчетнаяМассаПровода КАК бит_РасчетнаяМассаПровода,
	                      |	ТехнологическиеОперации.бит_КоэффициентИспользованияОборудования КАК бит_КоэффициентИспользованияОборудования,
	                      |	ТехнологическиеОперации.бит_ВыработкаПроводаСоВсейМашины КАК бит_ВыработкаПроводаСоВсейМашины,
	                      |	ТехнологическиеОперации.ВремяШтучное КАК ВремяШтучное,
	                      |	ТехнологическиеОперации.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм,
	                      |	ТехнологическиеОперации.Спецификация КАК Спецификация,
	                      |	ТехнологическиеОперации.Спецификация.ОсновноеИзделиеКоличествоУпаковок КАК КоличествоВыходногоИзделияИзСпецификации,
	                      |	ТехнологическиеОперации.Спецификация.ОсновноеИзделиеУпаковка КАК ЕдиницаИзмеренияВыходногоИзделияИзСпецификации,
	                      |	ТехнологическиеОперации.бит_РучнойВводНормыВыработки КАК бит_РучнойВводНормыВыработки
	                      |ИЗ
	                      |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	                      |ГДЕ
	                      |	ТехнологическиеОперации.Ссылка В(&Ссылка)");
		
	Запрос.УстановитьПараметр("Ссылка", Элементы.Список.ВыделенныеСтроки);
	ТаблицаНакладных.Загрузить(Запрос.Выполнить().Выгрузить());
	ЗаполнитьПоказателиПоНеколькимОперациям();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиПоНеколькимОперациям()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	База.Ссылка КАК Ссылка,
	                      |	База.бит_НормаВыработки КАК бит_НормаВыработки,
	                      |	База.бит_КоличествоХодов КАК бит_КоличествоХодов,
	                      |	База.бит_НормаВремени КАК бит_НормаВремени,
	                      |	База.бит_ТехнологическаяСкорость КАК бит_ТехнологическаяСкорость,
	                      |	База.бит_РасчетнаяМассаПровода КАК бит_РасчетнаяМассаПровода,
	                      |	База.бит_КоэффициентИспользованияОборудования КАК бит_КоэффициентИспользованияОборудования,
	                      |	База.бит_ВыработкаПроводаСоВсейМашины КАК бит_ВыработкаПроводаСоВсейМашины,
	                      |	База.ВремяШтучное КАК ВремяШтучное,
	                      |	База.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм,
	                      |	База.Спецификация КАК Спецификация,
	                      |	База.КоличествоВыходногоИзделияИзСпецификации КАК КоличествоВыходногоИзделияИзСпецификации,
	                      |	База.ЕдиницаИзмеренияВыходногоИзделияИзСпецификации КАК ЕдиницаИзмеренияВыходногоИзделияИзСпецификации,
						  | База.бит_РучнойВводНормыВыработки КАК бит_РучнойВводНормыВыработки
						  |	ПОМЕСТИТЬ База
						  |ИЗ
	                      |	&База КАК База
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.Ссылка) КАК Ссылка,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_НормаВыработки) КАК бит_НормаВыработки,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_КоличествоХодов) КАК бит_КоличествоХодов,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_НормаВремени) КАК бит_НормаВремени,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_ТехнологическаяСкорость) КАК бит_ТехнологическаяСкорость,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_РасчетнаяМассаПровода) КАК бит_РасчетнаяМассаПровода,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_КоэффициентИспользованияОборудования) КАК бит_КоэффициентИспользованияОборудования,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_ВыработкаПроводаСоВсейМашины) КАК бит_ВыработкаПроводаСоВсейМашины,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.ВремяШтучное) КАК ВремяШтучное,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.ВремяШтучноеЕдИзм) КАК ВремяШтучноеЕдИзм,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.Спецификация) КАК Спецификация,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.КоличествоВыходногоИзделияИзСпецификации) КАК КоличествоВыходногоИзделияИзСпецификации,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.ЕдиницаИзмеренияВыходногоИзделияИзСпецификации) КАК ЕдиницаИзмеренияВыходногоИзделияИзСпецификации,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ База.бит_РучнойВводНормыВыработки) КАК бит_РучнойВводНормыВыработки
	                      |ИЗ
	                      |	База КАК База");
	Запрос.УстановитьПараметр("База", ТаблицаНакладных.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() = Ложь Тогда
		Возврат;
	КонецЕсли;
	Если Выборка.бит_НормаВыработки = 1 Тогда
		бит_НормаВыработки = ТаблицаНакладных[0].бит_НормаВыработки; 
	Иначе
		бит_НормаВыработки = 0;
	КонецЕсли;
	Если Выборка.бит_КоличествоХодов = 1 Тогда
		бит_КоличествоХодов = ТаблицаНакладных[0].бит_КоличествоХодов;
	Иначе
		бит_КоличествоХодов = 0;
	КонецЕсли;
	Если Выборка.бит_НормаВремени = 1 Тогда
		бит_НормаВремени = ТаблицаНакладных[0].бит_НормаВремени;
	Иначе
		бит_НормаВремени = 0;
	КонецЕсли;
	Если Выборка.бит_ТехнологическаяСкорость = 1 Тогда
		бит_ТехнологическаяСкорость = ТаблицаНакладных[0].бит_ТехнологическаяСкорость;
	Иначе
		бит_ТехнологическаяСкорость = 0;
	КонецЕсли;
	Если Выборка.бит_РасчетнаяМассаПровода = 1 Тогда
		бит_РасчетнаяМассаПровода = ТаблицаНакладных[0].бит_РасчетнаяМассаПровода;
	Иначе
		бит_РасчетнаяМассаПровода = 0;
	КонецЕсли;
	Если Выборка.бит_КоэффициентИспользованияОборудования = 1 Тогда
		бит_КоэффициентИспользованияОборудования = ТаблицаНакладных[0].бит_КоэффициентИспользованияОборудования;
	Иначе
		бит_КоэффициентИспользованияОборудования = 0;
	КонецЕсли;
	Если Выборка.бит_ВыработкаПроводаСоВсейМашины = 1 Тогда
		бит_ВыработкаПроводаСоВсейМашины = ТаблицаНакладных[0].бит_ВыработкаПроводаСоВсейМашины;
	Иначе
		бит_ВыработкаПроводаСоВсейМашины = 0;
	КонецЕсли;
	Если Выборка.ВремяШтучное = 1 Тогда
		ВремяШтучное = ТаблицаНакладных[0].ВремяШтучное;
	Иначе
		ВремяШтучное = 0;
	КонецЕсли;
	Если Выборка.ВремяШтучноеЕдИзм = 1 Тогда
		ВремяШтучноеЕдИзм = ТаблицаНакладных[0].ВремяШтучноеЕдИзм;
	Иначе
		ВремяШтучноеЕдИзм =	Перечисления.ЕдиницыИзмеренияВремени.ПустаяСсылка();
	КонецЕсли;
	Если Выборка.КоличествоВыходногоИзделияИзСпецификации = 1 Тогда
		КоличествоВыходногоИзделияИзСпецификации = ТаблицаНакладных[0].КоличествоВыходногоИзделияИзСпецификации;
	Иначе
		КоличествоВыходногоИзделияИзСпецификации = 0;
	КонецЕсли;
	Если Выборка.ЕдиницаИзмеренияВыходногоИзделияИзСпецификации = 1 Тогда
		ЕдиницаИзмеренияВыходногоИзделияИзСпецификации = ТаблицаНакладных[0].ЕдиницаИзмеренияВыходногоИзделияИзСпецификации;
	Иначе
		ЕдиницаИзмеренияВыходногоИзделияИзСпецификации = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Если Выборка.бит_РучнойВводНормыВыработки = 1 Тогда
		бит_РучнойВводНормыВыработки = ТаблицаНакладных[0].бит_РучнойВводНормыВыработки;
	Иначе
		бит_РучнойВводНормыВыработки = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоОднойОперации(ТД)
	
	бит_НормаВыработки								= ТекОперация.бит_НормаВыработки;
	бит_КоличествоХодов								= ТекОперация.бит_КоличествоХодов;
	бит_НормаВремени								= ТекОперация.бит_НормаВремени;
	бит_ТехнологическаяСкорость						= ТекОперация.бит_ТехнологическаяСкорость;
	бит_РасчетнаяМассаПровода						= ТекОперация.бит_РасчетнаяМассаПровода;
	бит_КоэффициентИспользованияОборудования		= ТекОперация.бит_КоэффициентИспользованияОборудования;
	бит_ВыработкаПроводаСоВсейМашины				= ТекОперация.бит_ВыработкаПроводаСоВсейМашины;
	ВремяШтучное									= ТекОперация.ВремяШтучное;
	ВремяШтучноеЕдИзм								= ТекОперация.ВремяШтучноеЕдИзм;	
	КоличествоВыходногоИзделияИзСпецификации		= ТекОперация.Спецификация.ОсновноеИзделиеКоличествоУпаковок;
	ЕдиницаИзмеренияВыходногоИзделияИзСпецификации	= ТекОперация.Спецификация.ОсновноеИзделиеУпаковка;
	бит_РучнойВводНормыВыработки					= ТекОперация.бит_РучнойВводНормыВыработки;
	// Виды Работ Отображает указанные для выделенной операции Виды работ, указанные в Ресурсной спецификации.   
	ЗаполнитьВидыРабот();
	// Заполнить расценки   
	ЗаполнитьРасценки();	

КонецПроцедуры

&НаКлиенте
Процедура бит_КоличествоХодовПриИзменении(Элемент)
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(, "бит_КоличествоХодов");
КонецПроцедуры                                    

&НаКлиенте
Процедура бит_ТехнологическаяСкоростьПриИзменении(Элемент)
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(, "бит_ТехнологическаяСкорость");
КонецПроцедуры

&НаКлиенте
Процедура бит_РасчетнаяМассаПроводаПриИзменении(Элемент)
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(, "бит_РасчетнаяМассаПровода");
КонецПроцедуры

&НаКлиенте
Процедура бит_КоэффициентИспользованияОборудованияПриИзменении(Элемент)
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(, "бит_КоэффициентИспользованияОборудования");
КонецПроцедуры

&НаСервере
Процедура бит_ПересчитатьВыработкуПроводаСоВсейМашины(ОперацияОбъект = Неопределено, ИмяКолонки = Неопределено)
	
	ЕстьИзмененияПараметров = Истина;
	
	Если ИмяКолонки <> Неопределено Тогда
		Для каждого стр из ТаблицаНакладных Цикл
				стр[ИмяКолонки] = ЭтаФорма[ИмяКолонки];	
		КонецЦикла;	
	КонецЕсли;
	
	Если ТаблицаНакладных.Количество() И ОперацияОбъект = Неопределено Тогда 
		Для каждого стр из ТаблицаНакладных Цикл
				стр.бит_ВыработкаПроводаСоВсейМашины = ((стр.бит_ТехнологическаяСкорость * 6 / 100) 
																		* стр.бит_РасчетнаяМассаПровода 
																		* стр.бит_КоличествоХодов 
																		* стр.бит_КоэффициентИспользованияОборудования);
				Если бит_РучнойВводНормыВыработки Тогда
					Если стр.бит_НормаВыработки = стр.бит_ВыработкаПроводаСоВсейМашины Тогда
						//стр.бит_РучнойВводНормыВыработки = Ложь;
						ПослеИзмененияВыработкиСоВсейМашины(стр);
					иначе                         
						стр.бит_РучнойВводНормыВыработки = Истина;
					КонецЕсли; 
				Иначе
					ПослеИзмененияВыработкиСоВсейМашины(стр);
				КонецЕсли;
		КонецЦикла;
		ЗаполнитьПоказателиПоНеколькимОперациям();	
	Иначе                                                               
		Если ОперацияОбъект = Неопределено Тогда   
			Коллекция = ЭтаФорма;
		Иначе           
			Коллекция = ОперацияОбъект;
		КонецЕсли;
		
		Коллекция["бит_ВыработкаПроводаСоВсейМашины"] = ((Коллекция["бит_ТехнологическаяСкорость"] * 6 / 100) 
																		* Коллекция["бит_РасчетнаяМассаПровода"] 
																		* Коллекция["бит_КоличествоХодов"]
																		* Коллекция["бит_КоэффициентИспользованияОборудования"]);	
		Если бит_РучнойВводНормыВыработки Тогда
			Если Коллекция["бит_НормаВыработки"] = Коллекция["бит_ВыработкаПроводаСоВсейМашины"] Тогда
				//Коллекция["бит_РучнойВводНормыВыработки"] = Ложь;
				бит_РучнойВводНормыВыработки = Ложь;
				
				ПослеИзмененияВыработкиСоВсейМашины(Коллекция);	
			Иначе
				Коллекция["бит_РучнойВводНормыВыработки"] = Истина;
			КонецЕсли;  
		иначе
			ПослеИзмененияВыработкиСоВсейМашины(Коллекция);
		КонецЕсли;
		// пересчитаем для трудозатрат
		Для каждого стр из ВидыРабот Цикл
			Если стр.ЗначениеВидимость Тогда  // то что относится к текущей операции/этапу
				стр.Количество = бит_НормаВремени; // время выполнения переведем в часы
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияВыработкиСоВсейМашины(Коллекция)
	
	Коллекция["бит_НормаВыработки"] = Коллекция["бит_ВыработкаПроводаСоВсейМашины"];  
	Коллекция["бит_РучнойВводНормыВыработки"] = Ложь;
	
	Если Коллекция["бит_ВыработкаПроводаСоВсейМашины"] <> 0 Тогда 
    	Коллекция["бит_НормаВремени"] = 1 / Коллекция["бит_ВыработкаПроводаСоВсейМашины"];  
	Иначе
		Коллекция["бит_НормаВремени"] = 0;
	КонецЕсли;	
	     
	Коллекция["ВремяШтучное"] = Коллекция["бит_НормаВремени"] * 60;
	Коллекция["ВремяШтучноеЕдИзм"] = Перечисления.ЕдиницыИзмеренияВремени.Минута;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьЭлементов()
	
	ТолькоОднаОперация = СписокВыделенныхСтрок.Количество() = 1;
	
	Элементы.бит_ТехнологическаяСкорость.Доступность = ТолькоОднаОперация;
	Элементы.бит_РасчетнаяМассаПровода.Доступность 	 = ТолькоОднаОперация;
	Элементы.ВидыРабот.КоманднаяПанель.Доступность 	 = ТолькоОднаОперация;
	//Элементы.ВидыРабот.Доступность 			   = Не ТолькоОднаОперация;
	Элементы.РасценкиОперации.КоманднаяПанель.Доступность = ТолькоОднаОперация;										
	//Элементы.РасценкиОперации.Доступность = Не ТолькоОднаОперация;
	
КонецПроцедуры

#Область ВидыРабот

&НаКлиенте
Процедура Добавить(Команда)
	
	// При добавлении "Вида работ" количество вида работ транслируется из значения 
	// "Время выполнения" выделенной операции с переводом в единицу измерения "часы". 
	// Единица измерения транслируется из вида работ. 
	// Статья калькуляции по умолчанию устанавливается "Оплата труда"   
	ПФ = Новый Структура;
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);          
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораВидаРабот", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыРаботСотрудников.Форма.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры                                      

&НаКлиенте
Процедура ПослеВыбораВидаРабот(ВыбЗначение, ДопПараметры) Экспорт 
	
	Если ВыбЗначение <> Неопределено Тогда
		нов = ВидыРабот.Добавить();
		нов.НомерСтроки = ВидыРабот.Количество();
		нов.ВидРабот = ВыбЗначение;
		нов.Количество = ВремяВЧасах(ВремяШтучное, ВремяШтучноеЕдИзм); 
	    нов.СтатьяКалькуляции = СтатьяКалькуляцииПоУмолчанию;
		нов.Операция = ТекОперация;
		нов.Этап = ЭтапПоОперации();   
		нов.ЗначениеВидимость = Истина;
		
		ЕстьИзменениеВидовРабот = Истина;	
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Функция ЭтапПоОперации(Операция = Неопределено)
	
	Если Операция = Неопределено Тогда
		Операция = ТекОперация;
	КонецЕсли;
	
	Если ТипЗнч(Операция.Владелец) = Тип("СправочникСсылка.ЭтапыПроизводства") Тогда
		Возврат Операция.Владелец;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ВремяВЧасах(Время, ВремяЕдИзм)

	Если ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда 					
		Результат = Время; //Час	
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда		
		Результат = Время / 60; //Минута
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Секунда Тогда	
		Результат = Время / 3600; //Секунда
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.День Тогда 		
		Результат = Время * 24; //День
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда 		
		Результат = Время * 24; //Сутки 
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда 		
		Результат = Время * 24 * 30.4375; //Месяц
	ИначеЕсли ВремяЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда		
		Результат = Время * 24 * 30.4375 * 12; //Год
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)   
	
	МассивВыделенныхСтрок = Элементы.ВидыРабот.ВыделенныеСтроки;
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменениеВидовРабот = Истина;
	
	Для Каждого Элемент Из МассивВыделенныхСтрок Цикл 
    	текДанные = ВидыРабот.НайтиПоИдентификатору(Элемент);        
        ВидыРабот.Удалить(текДанные);
	КонецЦикла;
	// пересчитаем номера строк
	НомерСтроки = 1;
	Для каждого стр из ВидыРабот Цикл
		стр.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПрименитьИзменения(Команда)   
	
	ПрименитьНаСервере();
	
	ПерезаполнитьПараметры();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере() 
	
	НачатьТранзакцию();
	Попытка
		Для каждого стр из СписокВыделенныхСтрок Цикл
			ОперацияОбъект = стр.Значение.ПолучитьОбъект();
			Если ЗначениеЗаполнено(бит_НормаВыработки) Тогда
				ОперацияОбъект.бит_НормаВыработки = бит_НормаВыработки;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_КоличествоХодов) Тогда
				ОперацияОбъект.бит_КоличествоХодов = бит_КоличествоХодов;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_НормаВремени) Тогда
				ОперацияОбъект.бит_НормаВремени = бит_НормаВремени;     
				// в поле "Время выполнения" текущей операции
				ОперацияОбъект.ВремяШтучное = ОперацияОбъект.бит_НормаВремени * 60;
				ОперацияОбъект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_ТехнологическаяСкорость) Тогда
				ОперацияОбъект.бит_ТехнологическаяСкорость = бит_ТехнологическаяСкорость;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_РасчетнаяМассаПровода) Тогда
				ОперацияОбъект.бит_РасчетнаяМассаПровода = бит_РасчетнаяМассаПровода;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_КоэффициентИспользованияОборудования) Тогда
				ОперацияОбъект.бит_КоэффициентИспользованияОборудования = бит_КоэффициентИспользованияОборудования;
			КонецЕсли;
			Если ЗначениеЗаполнено(бит_ВыработкаПроводаСоВсейМашины) Тогда
				ОперацияОбъект.бит_ВыработкаПроводаСоВсейМашины = бит_ВыработкаПроводаСоВсейМашины;
			КонецЕсли;
			
			бит_ПересчитатьВыработкуПроводаСоВсейМашины(ОперацияОбъект);
			
			ОперацияОбъект.Записать(); 
			// виды работ
            РесурснаяСпецификацияОбъект = стр.Значение.Спецификация.ПолучитьОбъект();
			Если ВидыРабот.Количество() Тогда
				РесурснаяСпецификацияОбъект.Трудозатраты.Загрузить(ВидыРабот.Выгрузить());  
				Для каждого текТрудозатрата из РесурснаяСпецификацияОбъект.Трудозатраты Цикл
						текТрудозатрата.ЭтапРедактирование = текТрудозатрата.Этап;
						текТрудозатрата.ОперацияРедактирование = текТрудозатрата.Операция;
				КонецЦикла;
			Иначе
				Для каждого текТрудозатрата из РесурснаяСпецификацияОбъект.Трудозатраты Цикл
					Если текТрудозатрата.Операция = стр.Значение Или текТрудозатрата.ОперацияРедактирование = стр.Значение Тогда
						текТрудозатрата.Количество = ОперацияОбъект.бит_НормаВремени; 
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			РесурснаяСпецификацияОбъект.Записать();
					
	        // После нажатия аналогично п.3 Задачи 2 поле "Норма времени" транслируется:
			
			// в поле "Длительность этапа" в вышестоящий этап операции в часах с округлением в большую сторону:    
			Этап = ЭтапПоОперации(стр.Значение); 
			Если ЗначениеЗаполнено(Этап) Тогда
				ЭтапОбъект = Этап.ПолучитьОбъект();
				ЭтапОбъект.ДлительностьЭтапа = бит_ОбщегоНазначенияСервер.ОкруглитьВверх(бит_НормаВремени);
				ЭтапОбъект.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.Час;
				// поле "Время работы" для видов рабочих центров, указанных в этапе в минутах: 
				НормаВремениВМинутах = бит_НормаВремени * 60;
				Для каждого стр из ЭтапОбъект.ВидыРабочихЦентров Цикл
					стр.ВремяРаботы = НормаВремениВМинутах;
					стр.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута;
				КонецЦикла; 
			    Для каждого стр из ЭтапОбъект.АльтернативныеВидыРабочихЦентров Цикл
					стр.ВремяРаботы = НормаВремениВМинутах;
					стр.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута;
				КонецЦикла; 
				ЭтапОбъект.Записать();  
			КонецЕсли;
			
		КонецЦикла;
		
		ЕстьИзменениеВидовРабот = Ложь;
		ЕстьИзмененияПараметров = Ложь;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасценку(Команда)

	// При нажатии кнопки "Установить расценку" должно появляться окно со вводом значения 
	// "Цена за единицу измерения вида работ" 
	// и "Даты установки расценки". 
	// Пользователь устанавливает значение, нажимает "Ок". 
	// Система записывает значение расценки в регистр сведений "Расценки на работы сотрудников", 
	// формируя идентичные записи для каждого квалификационного разряда в виде:
	
	// Вид работ транслируется из выделенной строки в области "Виды работ". 
	// Разряды для формирования набора записей регистра берутся все существующие в системе.
	ТД = Элементы.ВидыРабот.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекВидРабот = ТД.ВидРабот;                                                                                                                      
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВводаПараметровРасценки", ЭтотОбъект, ТекВидРабот); 
	ОткрытьФорму("Обработка.бит_АРМНормирования.Форма.ФормаЗапросПараметровРасценки", , ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПараметровРасценки(РезультатЗакрытия, ТекВидРабот) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ЗаписатьРасценку(РезультатЗакрытия, ТекВидРабот);
	
КонецПроцедуры       

&НаСервере
Процедура ЗаписатьРасценку(Знач РезультатЗакрытия, Знач ТекВидРабот)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РазрядыКатегорииДолжностей.Ссылка КАК КвалификационныйРазряд,
	                      |	&ВидРабот КАК ВидРабот,
	                      |	&Расценка КАК Расценка,
	                      |	&Период КАК Период
	                      |ИЗ
	                      |	Справочник.РазрядыКатегорииДолжностей КАК РазрядыКатегорииДолжностей
	                      |ГДЕ
	                      |	НЕ РазрядыКатегорииДолжностей.ПометкаУдаления");
	Запрос.УстановитьПараметр("ВидРабот", ТекВидРабот);
	Запрос.УстановитьПараметр("Расценка", РезультатЗакрытия.Цена);
	Запрос.УстановитьПараметр("Период", РезультатЗакрытия.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.РасценкиРаботСотрудников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Записать();
	КонецЦикла;
	
	ЗаполнитьРасценки();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьРасценки(Команда)
	ЗаполнитьРасценки();
КонецПроцедуры

&НаКлиенте
Процедура РасценкиОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
      
&НаКлиенте
Процедура РасценкиОперацииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура бит_НормаВыработкиПриИзменении(Элемент)  
	
	ЕстьИзмененияПараметров = Истина;
	
	Если бит_НормаВыработки = 0 Тогда
		бит_НормаВремени = 0;
		ВремяШтучное = 0;
	Иначе		
		ВремяШтучноеЕдИзм = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Минута");
		бит_НормаВремени = 1 / бит_НормаВыработки;
		ВремяШтучное = бит_НормаВремени * 60; 
	КонецЕсли;                              
	
	Если ТаблицаНакладных.Количество() Тогда 
		Для каждого стр из ТаблицаНакладных Цикл
			стр.бит_НормаВыработки = бит_НормаВыработки;
			стр.бит_НормаВремени = бит_НормаВремени;
			стр.ВремяШтучное = ВремяШтучное;
			стр.ВремяШтучноеЕдИзм = ВремяШтучноеЕдИзм;
			стр.бит_РучнойВводНормыВыработки = ОпределитьРучноеИзменениеВыработки(стр);
		КонецЦикла;	
		ЗаполнитьПоказателиПоНеколькимОперациям();
	Иначе
		бит_РучнойВводНормыВыработки = ОпределитьРучноеИзменениеВыработки(ЭтаФорма); 
		Для каждого стр из ВидыРабот Цикл
			Если стр.ЗначениеВидимость Тогда  // то что относится к текущей операции/этапу
				стр.Количество = бит_НормаВремени; // время выполнения переведем в часы
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры                 

&НаКлиенте
Функция ОпределитьРучноеИзменениеВыработки(Коллекция)

	// посчитаем выработку со всей машины параметрически, то есть по данным выпуска со всей машины
	Возврат Коллекция["бит_НормаВыработки"] <> Коллекция["бит_ВыработкаПроводаСоВсейМашины"];  

КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры
